report_test/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 75,
    "errorCount" : 75,
    "errorPct" : 100.0,
    "meanResTime" : 2.8666666666666663,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 10.200000000000074,
    "pct3ResTime" : 31.0,
    "throughput" : 7.988071147087017,
    "receivedKBytesPerSec" : 20.516237418787945,
    "sentKBytesPerSec" : 0.0
  },
  "POST /api/auth/logout" : {
    "transaction" : "POST /api/auth/logout",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 7.2,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 31.0,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 31.0,
    "throughput" : 3.348961821835231,
    "receivedKBytesPerSec" : 8.601337491627595,
    "sentKBytesPerSec" : 0.0
  },
  "POST /api/auth/signup" : {
    "transaction" : "POST /api/auth/signup",
    "sampleCount" : 10,
    "errorCount" : 10,
    "errorPct" : 100.0,
    "meanResTime" : 4.699999999999999,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 28.10000000000001,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 31.0,
    "throughput" : 2.28675966155957,
    "receivedKBytesPerSec" : 5.873220615138349,
    "sentKBytesPerSec" : 0.0
  },
  "POST /api/auth/login" : {
    "transaction" : "POST /api/auth/login",
    "sampleCount" : 60,
    "errorCount" : 60,
    "errorPct" : 100.0,
    "meanResTime" : 2.200000000000001,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 2.8999999999999986,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 31.0,
    "throughput" : 6.3904569176696135,
    "receivedKBytesPerSec" : 16.412989935030357,
    "sentKBytesPerSec" : 0.0
  }
}